SpacehuhnTech/arduino/wifiduck/avr/boards.txt
menu.cpu=Processor
menu.keyboardid=USB Device ID
menu.protocol=Protocol
menu.debug=Debug
menu.led=LED
menu.ledpin=LED Pin
menu.bridge=Serial Bridge
menu.bridgebutton=Serial Bridge Enable Pin
menu.bridgerst=Serial Bridge Reset Pin
menu.bridge0=Serial Bridge GPIO-0 Pin

######################################
########## DSTIKE WiFi Duck ##########
######################################
dstike.name=DSTIKE WiFi Duck (ATmega32u4)

dstike.upload.tool=avrdude
dstike.upload.protocol=avr109
dstike.upload.maximum_size=28672
dstike.upload.maximum_data_size=2560
dstike.upload.speed=57600
dstike.upload.disable_flushing=true
dstike.upload.use_1200bps_touch=true
dstike.upload.wait_for_upload_port=true

dstike.bootloader.tool=avrdude
dstike.bootloader.unlock_bits=0x3F
dstike.bootloader.lock_bits=0x2F
dstike.bootloader.low_fuses=0xFF
dstike.bootloader.high_fuses=0xD8

dstike.build.board=AVR_ATMEGA32U4
dstike.build.core=arduino
dstike.build.variant=dstike
dstike.build.mcu=atmega32u4
dstike.build.usb_product="USB Keyboard"

dstike.build.f_cpu=16000000L
dstike.bootloader.extended_fuses=0xCB
dstike.bootloader.file=caterina/Caterina-promicro16.hex

dstike.build.protocol_flags=-DENABLE_I2C
dstike.build.led_flags=-DENABLE_LED -DNEOPIXEL
dstike.build.led_pin=-DLED_PIN=7

########## Keyboard ID ##########
dstike.menu.keyboardid.default=Arduino Leonardo
dstike.menu.keyboardid.default.build.vid=0x2341
dstike.menu.keyboardid.default.build.pid=0x8036

dstike.menu.keyboardid.apple=Apple Keyboard
dstike.menu.keyboardid.apple.build.vid=0x05ac
dstike.menu.keyboardid.apple.build.pid=0x0221

########## Debug ##########
dstike.menu.debug.serial=Serial (115200b, newline)
dstike.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

dstike.menu.debug.disabled=Disabled


################################
###### Generic ATmega32u4 ######
################################

atmega32u4.name=Generic ATmega32u4

atmega32u4.upload.tool=avrdude
atmega32u4.upload.protocol=avr109
atmega32u4.upload.maximum_size=28672
atmega32u4.upload.maximum_data_size=2560
atmega32u4.upload.speed=57600
atmega32u4.upload.disable_flushing=true
atmega32u4.upload.use_1200bps_touch=true
atmega32u4.upload.wait_for_upload_port=true

atmega32u4.bootloader.tool=avrdude
atmega32u4.bootloader.unlock_bits=0x3F
atmega32u4.bootloader.lock_bits=0x2F
atmega32u4.bootloader.low_fuses=0xFF
atmega32u4.bootloader.high_fuses=0xD8

atmega32u4.build.board=AVR_ATMEGA32U4
atmega32u4.build.core=arduino
atmega32u4.build.variant=atmega32u4
atmega32u4.build.mcu=atmega32u4
atmega32u4.build.usb_product="USB Keyboard"

########## 5V / 16MHz ##########
atmega32u4.menu.cpu.16MHzatmega32U4=5V, 16 MHz

atmega32u4.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L
atmega32u4.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
atmega32u4.menu.cpu.16MHzatmega32U4.bootloader.file=caterina/Caterina-promicro16.hex

########## 3.3V / 8MHz ##########
atmega32u4.menu.cpu.8MHzatmega32U4=3.3V, 8 MHz

atmega32u4.menu.cpu.8MHzatmega32U4.build.f_cpu=8000000L
atmega32u4.menu.cpu.8MHzatmega32U4.bootloader.extended_fuses=0xFE
atmega32u4.menu.cpu.8MHzatmega32U4.bootloader.file=caterina/Caterina-promicro8.hex

########## Keyboard ID ##########
atmega32u4.menu.keyboardid.default=Arduino Leonardo
atmega32u4.menu.keyboardid.default.build.vid=0x2341
atmega32u4.menu.keyboardid.default.build.pid=0x8036

atmega32u4.menu.keyboardid.apple=Apple Keyboard
atmega32u4.menu.keyboardid.apple.build.vid=0x05ac
atmega32u4.menu.keyboardid.apple.build.pid=0x0221

########## Protocol ##########
atmega32u4.menu.protocol.auto=Auto (I2C & Serial)
atmega32u4.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

atmega32u4.menu.protocol.i2c=I2C
atmega32u4.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

atmega32u4.menu.protocol.serial=Serial
atmega32u4.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
atmega32u4.menu.debug.serial=Serial (115200b, newline)
atmega32u4.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

atmega32u4.menu.debug.disabled=Disabled

########## LED ##########
atmega32u4.menu.led.disabled=Disabled

atmega32u4.menu.led.neopixel=Neopixel (WS2812b)
atmega32u4.menu.led.neopixel.build.led_flags=-DENABLE_LED -DNEOPIXEL

atmega32u4.menu.ledpin.0=0 (RX Serial) [PD2]
atmega32u4.menu.ledpin.0.build.led_pin=-DLED_PIN=0
atmega32u4.menu.ledpin.1=1 (TX Serial) [PD3]
atmega32u4.menu.ledpin.1.build.led_pin=-DLED_PIN=1
atmega32u4.menu.ledpin.2=2 (SDA I2C) [PD1]
atmega32u4.menu.ledpin.2.build.led_pin=-DLED_PIN=2
atmega32u4.menu.ledpin.3=3 (SCL I2C) [PD0]
atmega32u4.menu.ledpin.3.build.led_pin=-DLED_PIN=3
atmega32u4.menu.ledpin.4=4 (A6) [PD4]
atmega32u4.menu.ledpin.4.build.led_pin=-DLED_PIN=4
atmega32u4.menu.ledpin.5=5 [PC6]
atmega32u4.menu.ledpin.5.build.led_pin=-DLED_PIN=5
atmega32u4.menu.ledpin.6=6 (A7) [PD7]
atmega32u4.menu.ledpin.6.build.led_pin=-DLED_PIN=6
atmega32u4.menu.ledpin.7=7 [PE6]
atmega32u4.menu.ledpin.7.build.led_pin=-DLED_PIN=7
atmega32u4.menu.ledpin.8=8 (A8) [PB4]
atmega32u4.menu.ledpin.8.build.led_pin=-DLED_PIN=8
atmega32u4.menu.ledpin.9=9 (A9) [PB5]
atmega32u4.menu.ledpin.9.build.led_pin=-DLED_PIN=9
atmega32u4.menu.ledpin.10=10 (A10) [PB6]
atmega32u4.menu.ledpin.10.build.led_pin=-DLED_PIN=10
atmega32u4.menu.ledpin.11=11 [PB7]
atmega32u4.menu.ledpin.11.build.led_pin=-DLED_PIN=11
atmega32u4.menu.ledpin.12=12 (A11) [PD6]
atmega32u4.menu.ledpin.12.build.led_pin=-DLED_PIN=12
atmega32u4.menu.ledpin.13=13 [PC7]
atmega32u4.menu.ledpin.13.build.led_pin=-DLED_PIN=13
atmega32u4.menu.ledpin.14=14 (MISO SPI) [PB3]
atmega32u4.menu.ledpin.14.build.led_pin=-DLED_PIN=14
atmega32u4.menu.ledpin.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.ledpin.15.build.led_pin=-DLED_PIN=15
atmega32u4.menu.ledpin.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.ledpin.16.build.led_pin=-DLED_PIN=16
atmega32u4.menu.ledpin.17=17 (SS SPI) [PB0]
atmega32u4.menu.ledpin.17.build.led_pin=-DLED_PIN=17
atmega32u4.menu.ledpin.18=18 (A0) [PF7]
atmega32u4.menu.ledpin.18.build.led_pin=-DLED_PIN=18
atmega32u4.menu.ledpin.19=19 (A1) [PF6]
atmega32u4.menu.ledpin.19.build.led_pin=-DLED_PIN=19
atmega32u4.menu.ledpin.20=20 (A2) [PF5]
atmega32u4.menu.ledpin.20.build.led_pin=-DLED_PIN=20
atmega32u4.menu.ledpin.21=21 (A3) [PF4]
atmega32u4.menu.ledpin.21.build.led_pin=-DLED_PIN=21
atmega32u4.menu.ledpin.22=22 (A4) [PF1]
atmega32u4.menu.ledpin.22.build.led_pin=-DLED_PIN=22
atmega32u4.menu.ledpin.23=23 (A5) [PF0]
atmega32u4.menu.ledpin.23.build.led_pin=-DLED_PIN=23

########## Serial Bridge ##########
atmega32u4.menu.bridge.disabled=Disabled

atmega32u4.menu.bridge.serial1=Serial1
atmega32u4.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

