SpacehuhnTech/arduino/wifiduck/avr/boards.txt
atmega32u4.menu.bridgebutton.2=2 (SDA I2C) [PD1]
atmega32u4.menu.bridgebutton.2.build.led_pin=-DLED_PIN=2
atmega32u4.menu.bridgebutton.3=3 (SCL I2C) [PD0]
atmega32u4.menu.bridgebutton.3.build.led_pin=-DLED_PIN=3
atmega32u4.menu.bridgebutton.4=4 (A6) [PD4]
atmega32u4.menu.bridgebutton.4.build.led_pin=-DLED_PIN=4
atmega32u4.menu.bridgebutton.5=5 [PC6]
atmega32u4.menu.bridgebutton.5.build.led_pin=-DLED_PIN=5
atmega32u4.menu.bridgebutton.6=6 (A7) [PD7]
atmega32u4.menu.bridgebutton.6.build.led_pin=-DLED_PIN=6
atmega32u4.menu.bridgebutton.7=7 [PE6]
atmega32u4.menu.bridgebutton.7.build.led_pin=-DLED_PIN=7
atmega32u4.menu.bridgebutton.8=8 (A8) [PB4]
atmega32u4.menu.bridgebutton.8.build.led_pin=-DLED_PIN=8
atmega32u4.menu.bridgebutton.9=9 (A9) [PB5]
atmega32u4.menu.bridgebutton.9.build.led_pin=-DLED_PIN=9
atmega32u4.menu.bridgebutton.10=10 (A10) [PB6]
atmega32u4.menu.bridgebutton.10.build.led_pin=-DLED_PIN=10
atmega32u4.menu.bridgebutton.11=11 [PB7]
atmega32u4.menu.bridgebutton.11.build.led_pin=-DLED_PIN=11
atmega32u4.menu.bridgebutton.12=12 (A11) [PD6]
atmega32u4.menu.bridgebutton.12.build.led_pin=-DLED_PIN=12
atmega32u4.menu.bridgebutton.13=13 [PC7]
atmega32u4.menu.bridgebutton.13.build.led_pin=-DLED_PIN=13
atmega32u4.menu.bridgebutton.14=14 (MISO SPI) [PB3]
atmega32u4.menu.bridgebutton.14.build.led_pin=-DLED_PIN=14
atmega32u4.menu.bridgebutton.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.bridgebutton.15.build.led_pin=-DLED_PIN=15
atmega32u4.menu.bridgebutton.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.bridgebutton.16.build.led_pin=-DLED_PIN=16
atmega32u4.menu.bridgebutton.17=17 (SS SPI) [PB0]
atmega32u4.menu.bridgebutton.17.build.led_pin=-DLED_PIN=17
atmega32u4.menu.bridgebutton.18=18 (A0) [PF7]
atmega32u4.menu.bridgebutton.18.build.led_pin=-DLED_PIN=18
atmega32u4.menu.bridgebutton.19=19 (A1) [PF6]
atmega32u4.menu.bridgebutton.19.build.led_pin=-DLED_PIN=19
atmega32u4.menu.bridgebutton.20=20 (A2) [PF5]
atmega32u4.menu.bridgebutton.20.build.led_pin=-DLED_PIN=20
atmega32u4.menu.bridgebutton.21=21 (A3) [PF4]
atmega32u4.menu.bridgebutton.21.build.led_pin=-DLED_PIN=21
atmega32u4.menu.bridgebutton.22=22 (A4) [PF1]
atmega32u4.menu.bridgebutton.22.build.led_pin=-DLED_PIN=22
atmega32u4.menu.bridgebutton.23=23 (A5) [PF0]
atmega32u4.menu.bridgebutton.23.build.led_pin=-DLED_PIN=23

atmega32u4.menu.bridgerst.2=2 (SDA I2C) [PD1]
atmega32u4.menu.bridgerst.2.build.led_pin=-DLED_PIN=2
atmega32u4.menu.bridgerst.3=3 (SCL I2C) [PD0]
atmega32u4.menu.bridgerst.3.build.led_pin=-DLED_PIN=3
atmega32u4.menu.bridgerst.4=4 (A6) [PD4]
atmega32u4.menu.bridgerst.4.build.led_pin=-DLED_PIN=4
atmega32u4.menu.bridgerst.5=5 [PC6]
atmega32u4.menu.bridgerst.5.build.led_pin=-DLED_PIN=5
atmega32u4.menu.bridgerst.6=6 (A7) [PD7]
atmega32u4.menu.bridgerst.6.build.led_pin=-DLED_PIN=6
atmega32u4.menu.bridgerst.7=7 [PE6]
atmega32u4.menu.bridgerst.7.build.led_pin=-DLED_PIN=7
atmega32u4.menu.bridgerst.8=8 (A8) [PB4]
atmega32u4.menu.bridgerst.8.build.led_pin=-DLED_PIN=8
atmega32u4.menu.bridgerst.9=9 (A9) [PB5]
atmega32u4.menu.bridgerst.9.build.led_pin=-DLED_PIN=9
atmega32u4.menu.bridgerst.10=10 (A10) [PB6]
atmega32u4.menu.bridgerst.10.build.led_pin=-DLED_PIN=10
atmega32u4.menu.bridgerst.11=11 [PB7]
atmega32u4.menu.bridgerst.11.build.led_pin=-DLED_PIN=11
atmega32u4.menu.bridgerst.12=12 (A11) [PD6]
atmega32u4.menu.bridgerst.12.build.led_pin=-DLED_PIN=12
atmega32u4.menu.bridgerst.13=13 [PC7]
atmega32u4.menu.bridgerst.13.build.led_pin=-DLED_PIN=13
atmega32u4.menu.bridgerst.14=14 (MISO SPI) [PB3]
atmega32u4.menu.bridgerst.14.build.led_pin=-DLED_PIN=14
atmega32u4.menu.bridgerst.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.bridgerst.15.build.led_pin=-DLED_PIN=15
atmega32u4.menu.bridgerst.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.bridgerst.16.build.led_pin=-DLED_PIN=16
atmega32u4.menu.bridgerst.17=17 (SS SPI) [PB0]
atmega32u4.menu.bridgerst.17.build.led_pin=-DLED_PIN=17
atmega32u4.menu.bridgerst.18=18 (A0) [PF7]
atmega32u4.menu.bridgerst.18.build.led_pin=-DLED_PIN=18
atmega32u4.menu.bridgerst.19=19 (A1) [PF6]
atmega32u4.menu.bridgerst.19.build.led_pin=-DLED_PIN=19
atmega32u4.menu.bridgerst.20=20 (A2) [PF5]
atmega32u4.menu.bridgerst.20.build.led_pin=-DLED_PIN=20
atmega32u4.menu.bridgerst.21=21 (A3) [PF4]
atmega32u4.menu.bridgerst.21.build.led_pin=-DLED_PIN=21
atmega32u4.menu.bridgerst.22=22 (A4) [PF1]
atmega32u4.menu.bridgerst.22.build.led_pin=-DLED_PIN=22
atmega32u4.menu.bridgerst.23=23 (A5) [PF0]
atmega32u4.menu.bridgerst.23.build.led_pin=-DLED_PIN=23

atmega32u4.menu.bridge0.2=2 (SDA I2C) [PD1]
atmega32u4.menu.bridge0.2.build.led_pin=-DLED_PIN=2
atmega32u4.menu.bridge0.3=3 (SCL I2C) [PD0]
atmega32u4.menu.bridge0.3.build.led_pin=-DLED_PIN=3
atmega32u4.menu.bridge0.4=4 (A6) [PD4]
atmega32u4.menu.bridge0.4.build.led_pin=-DLED_PIN=4
atmega32u4.menu.bridge0.5=5 [PC6]
atmega32u4.menu.bridge0.5.build.led_pin=-DLED_PIN=5
atmega32u4.menu.bridge0.6=6 (A7) [PD7]
atmega32u4.menu.bridge0.6.build.led_pin=-DLED_PIN=6
atmega32u4.menu.bridge0.7=7 [PE6]
atmega32u4.menu.bridge0.7.build.led_pin=-DLED_PIN=7
atmega32u4.menu.bridge0.8=8 (A8) [PB4]
atmega32u4.menu.bridge0.8.build.led_pin=-DLED_PIN=8
atmega32u4.menu.bridge0.9=9 (A9) [PB5]
atmega32u4.menu.bridge0.9.build.led_pin=-DLED_PIN=9
atmega32u4.menu.bridge0.10=10 (A10) [PB6]
atmega32u4.menu.bridge0.10.build.led_pin=-DLED_PIN=10
atmega32u4.menu.bridge0.11=11 [PB7]
atmega32u4.menu.bridge0.11.build.led_pin=-DLED_PIN=11
atmega32u4.menu.bridge0.12=12 (A11) [PD6]
atmega32u4.menu.bridge0.12.build.led_pin=-DLED_PIN=12
atmega32u4.menu.bridge0.13=13 [PC7]
atmega32u4.menu.bridge0.13.build.led_pin=-DLED_PIN=13
atmega32u4.menu.bridge0.14=14 (MISO SPI) [PB3]
atmega32u4.menu.bridge0.14.build.led_pin=-DLED_PIN=14
atmega32u4.menu.bridge0.15=15 (SCLK SPI) [PB1]
atmega32u4.menu.bridge0.15.build.led_pin=-DLED_PIN=15
atmega32u4.menu.bridge0.16=16 (MOSI SPI) [PB2]
atmega32u4.menu.bridge0.16.build.led_pin=-DLED_PIN=16
atmega32u4.menu.bridge0.17=17 (SS SPI) [PB0]
atmega32u4.menu.bridge0.17.build.led_pin=-DLED_PIN=17
atmega32u4.menu.bridge0.18=18 (A0) [PF7]
atmega32u4.menu.bridge0.18.build.led_pin=-DLED_PIN=18
atmega32u4.menu.bridge0.19=19 (A1) [PF6]
atmega32u4.menu.bridge0.19.build.led_pin=-DLED_PIN=19
atmega32u4.menu.bridge0.20=20 (A2) [PF5]
atmega32u4.menu.bridge0.20.build.led_pin=-DLED_PIN=20
atmega32u4.menu.bridge0.21=21 (A3) [PF4]
atmega32u4.menu.bridge0.21.build.led_pin=-DLED_PIN=21
atmega32u4.menu.bridge0.22=22 (A4) [PF1]
atmega32u4.menu.bridge0.22.build.led_pin=-DLED_PIN=22
atmega32u4.menu.bridge0.23=23 (A5) [PF0]
atmega32u4.menu.bridge0.23.build.led_pin=-DLED_PIN=23

################################
###### Arduino Leonardo ########
################################

leonardo.name=Arduino Leonardo

leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F
leonardo.bootloader.low_fuses=0xFF
leonardo.bootloader.high_fuses=0xD8

leonardo.build.board=AVR_ATMEGA32U4
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.mcu=atmega32u4
atmega32u4.build.usb_product="USB Keyboard"

leonardo.build.f_cpu=16000000L
leonardo.bootloader.extended_fuses=0xCB
leonardo.bootloader.file=caterina/Caterina-Leonardo.hex

########## Keyboard ID ##########
leonardo.menu.keyboardid.default=Arduino Leonardo
leonardo.menu.keyboardid.default.build.vid=0x2341
leonardo.menu.keyboardid.default.build.pid=0x8036

leonardo.menu.keyboardid.apple=Apple Keyboard
leonardo.menu.keyboardid.apple.build.vid=0x05ac
leonardo.menu.keyboardid.apple.build.pid=0x0221

