SpacehuhnTech/arduino/wifiduck/avr/boards.txt
promicro.menu.bridgerst.2=2 (SDA I2C)
promicro.menu.bridgerst.2.build.led_pin=-DLED_PIN=2
promicro.menu.bridgerst.3=3 (SCL I2C)
promicro.menu.bridgerst.3.build.led_pin=-DLED_PIN=3
promicro.menu.bridgerst.4=4
promicro.menu.bridgerst.4.build.led_pin=-DLED_PIN=4
promicro.menu.bridgerst.5=5
promicro.menu.bridgerst.5.build.led_pin=-DLED_PIN=5
promicro.menu.bridgerst.6=6
promicro.menu.bridgerst.6.build.led_pin=-DLED_PIN=6
promicro.menu.bridgerst.7=7
promicro.menu.bridgerst.7.build.led_pin=-DLED_PIN=7
promicro.menu.bridgerst.8=8
promicro.menu.bridgerst.8.build.led_pin=-DLED_PIN=8
promicro.menu.bridgerst.9=9
promicro.menu.bridgerst.9.build.led_pin=-DLED_PIN=9
promicro.menu.bridgerst.10=10
promicro.menu.bridgerst.10.build.led_pin=-DLED_PIN=10
promicro.menu.bridgerst.14=14
promicro.menu.bridgerst.14.build.led_pin=-DLED_PIN=14
promicro.menu.bridgerst.15=15
promicro.menu.bridgerst.15.build.led_pin=-DLED_PIN=15
promicro.menu.bridgerst.16=16
promicro.menu.bridgerst.16.build.led_pin=-DLED_PIN=16
promicro.menu.bridgerst.18=A0
promicro.menu.bridgerst.18.build.led_pin=-DLED_PIN=18
promicro.menu.bridgerst.19=A1
promicro.menu.bridgerst.19.build.led_pin=-DLED_PIN=19
promicro.menu.bridgerst.20=A2
promicro.menu.bridgerst.20.build.led_pin=-DLED_PIN=20
promicro.menu.bridgerst.21=A3
promicro.menu.bridgerst.21.build.led_pin=-DLED_PIN=21

promicro.menu.bridge0.2=2 (SDA I2C)
promicro.menu.bridge0.2.build.led_pin=-DLED_PIN=2
promicro.menu.bridge0.3=3 (SCL I2C)
promicro.menu.bridge0.3.build.led_pin=-DLED_PIN=3
promicro.menu.bridge0.4=4
promicro.menu.bridge0.4.build.led_pin=-DLED_PIN=4
promicro.menu.bridge0.5=5
promicro.menu.bridge0.5.build.led_pin=-DLED_PIN=5
promicro.menu.bridge0.6=6
promicro.menu.bridge0.6.build.led_pin=-DLED_PIN=6
promicro.menu.bridge0.7=7
promicro.menu.bridge0.7.build.led_pin=-DLED_PIN=7
promicro.menu.bridge0.8=8
promicro.menu.bridge0.8.build.led_pin=-DLED_PIN=8
promicro.menu.bridge0.9=9
promicro.menu.bridge0.9.build.led_pin=-DLED_PIN=9
promicro.menu.bridge0.10=10
promicro.menu.bridge0.10.build.led_pin=-DLED_PIN=10
promicro.menu.bridge0.14=14
promicro.menu.bridge0.14.build.led_pin=-DLED_PIN=14
promicro.menu.bridge0.15=15
promicro.menu.bridge0.15.build.led_pin=-DLED_PIN=15
promicro.menu.bridge0.16=16
promicro.menu.bridge0.16.build.led_pin=-DLED_PIN=16
promicro.menu.bridge0.18=A0
promicro.menu.bridge0.18.build.led_pin=-DLED_PIN=18
promicro.menu.bridge0.19=A1
promicro.menu.bridge0.19.build.led_pin=-DLED_PIN=19
promicro.menu.bridge0.20=A2
promicro.menu.bridge0.20.build.led_pin=-DLED_PIN=20
promicro.menu.bridge0.21=A3
promicro.menu.bridge0.21.build.led_pin=-DLED_PIN=21

################################
######### CJMCU Beetle #########
################################

cjmcu.name=CJMCU Beetle

cjmcu.upload.tool=avrdude
cjmcu.upload.protocol=avr109
cjmcu.upload.maximum_size=28672
cjmcu.upload.maximum_data_size=2560
cjmcu.upload.speed=57600
cjmcu.upload.disable_flushing=true
cjmcu.upload.use_1200bps_touch=true
cjmcu.upload.wait_for_upload_port=true

cjmcu.bootloader.tool=avrdude
cjmcu.bootloader.unlock_bits=0x3F
cjmcu.bootloader.lock_bits=0x2F
cjmcu.bootloader.low_fuses=0xFF
cjmcu.bootloader.high_fuses=0xD8

cjmcu.build.board=AVR_ATMEGA32U4
cjmcu.build.core=arduino
cjmcu.build.variant=atmega32u4
cjmcu.build.mcu=atmega32u4
cjmcu.build.usb_product="USB Keyboard"

########## 5V / 16MHz ##########
cjmcu.build.f_cpu=16000000L
cjmcu.bootloader.extended_fuses=0xCB
cjmcu.bootloader.file=caterina/Caterina-promicro16.hex

########## Keyboard ID ##########
cjmcu.menu.keyboardid.default=Arduino Leonardo
cjmcu.menu.keyboardid.default.build.vid=0x2341
cjmcu.menu.keyboardid.default.build.pid=0x8036

cjmcu.menu.keyboardid.apple=Apple Keyboard
cjmcu.menu.keyboardid.apple.build.vid=0x05ac
cjmcu.menu.keyboardid.apple.build.pid=0x0221

########## Protocol ##########
cjmcu.menu.protocol.auto=Auto (I2C & Serial)
cjmcu.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

cjmcu.menu.protocol.i2c=I2C
cjmcu.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

cjmcu.menu.protocol.serial=Serial
cjmcu.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

########## Debug ##########
cjmcu.menu.debug.serial=Serial (115200b, newline)
cjmcu.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

cjmcu.menu.debug.disabled=Disabled

########## LED ##########
cjmcu.menu.led.disabled=Disabled

cjmcu.menu.led.neopixel=Neopixel (WS2812b)
cjmcu.menu.led.neopixel.build.led_flags=-DENABLE_LED -DNEOPIXEL

cjmcu.menu.ledpin.0=RX (Serial)
cjmcu.menu.ledpin.0.build.led_pin=-DLED_PIN=0
cjmcu.menu.ledpin.1=TX (Serial)
cjmcu.menu.ledpin.1.build.led_pin=-DLED_PIN=1
cjmcu.menu.ledpin.2=SDA (I2C)
cjmcu.menu.ledpin.2.build.led_pin=-DLED_PIN=2
cjmcu.menu.ledpin.3=SCL (I2C)
cjmcu.menu.ledpin.3.build.led_pin=-DLED_PIN=3
cjmcu.menu.ledpin.9=D9
cjmcu.menu.ledpin.9.build.led_pin=-DLED_PIN=9
cjmcu.menu.ledpin.10=D10
cjmcu.menu.ledpin.10.build.led_pin=-DLED_PIN=10
cjmcu.menu.ledpin.11=D11
cjmcu.menu.ledpin.11.build.led_pin=-DLED_PIN=11
cjmcu.menu.ledpin.14=MI (MISO SPI)
cjmcu.menu.ledpin.14.build.led_pin=-DLED_PIN=14
cjmcu.menu.ledpin.15=SCK (SCLK SPI)
cjmcu.menu.ledpin.15.build.led_pin=-DLED_PIN=15
cjmcu.menu.ledpin.16=MO (MOSI SPI)
cjmcu.menu.ledpin.16.build.led_pin=-DLED_PIN=16
cjmcu.menu.ledpin.18=A0
cjmcu.menu.ledpin.18.build.led_pin=-DLED_PIN=18
cjmcu.menu.ledpin.19=A1
cjmcu.menu.ledpin.19.build.led_pin=-DLED_PIN=19
cjmcu.menu.ledpin.20=A2
cjmcu.menu.ledpin.20.build.led_pin=-DLED_PIN=20

########## Serial Bridge ##########
cjmcu.menu.bridge.disabled=Disabled

cjmcu.menu.bridge.serial1=Serial1
cjmcu.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

cjmcu.menu.bridgebutton.2=SDA (I2C)
cjmcu.menu.bridgebutton.2.build.led_pin=-DLED_PIN=2
cjmcu.menu.bridgebutton.3=SCL (I2C)
cjmcu.menu.bridgebutton.3.build.led_pin=-DLED_PIN=3
cjmcu.menu.bridgebutton.9=D9
cjmcu.menu.bridgebutton.9.build.led_pin=-DLED_PIN=9
cjmcu.menu.bridgebutton.10=D10
cjmcu.menu.bridgebutton.10.build.led_pin=-DLED_PIN=10
cjmcu.menu.bridgebutton.11=D11
cjmcu.menu.bridgebutton.11.build.led_pin=-DLED_PIN=11
cjmcu.menu.bridgebutton.14=MI (MISO SPI)
cjmcu.menu.bridgebutton.14.build.led_pin=-DLED_PIN=14
cjmcu.menu.bridgebutton.15=SCK (SCLK SPI)
cjmcu.menu.bridgebutton.15.build.led_pin=-DLED_PIN=15
cjmcu.menu.bridgebutton.16=MO (MOSI SPI)
cjmcu.menu.bridgebutton.16.build.led_pin=-DLED_PIN=16
cjmcu.menu.bridgebutton.18=A0
cjmcu.menu.bridgebutton.18.build.led_pin=-DLED_PIN=18
cjmcu.menu.bridgebutton.19=A1
cjmcu.menu.bridgebutton.19.build.led_pin=-DLED_PIN=19
cjmcu.menu.bridgebutton.20=A2
cjmcu.menu.bridgebutton.20.build.led_pin=-DLED_PIN=20

cjmcu.menu.bridgerst.2=SDA (I2C)
cjmcu.menu.bridgerst.2.build.led_pin=-DLED_PIN=2
cjmcu.menu.bridgerst.3=SCL (I2C)
cjmcu.menu.bridgerst.3.build.led_pin=-DLED_PIN=3
cjmcu.menu.bridgerst.9=D9
cjmcu.menu.bridgerst.9.build.led_pin=-DLED_PIN=9
cjmcu.menu.bridgerst.10=D10
cjmcu.menu.bridgerst.10.build.led_pin=-DLED_PIN=10
cjmcu.menu.bridgerst.11=D11
cjmcu.menu.bridgerst.11.build.led_pin=-DLED_PIN=11
cjmcu.menu.bridgerst.14=MI (MISO SPI)
cjmcu.menu.bridgerst.14.build.led_pin=-DLED_PIN=14
cjmcu.menu.bridgerst.15=SCK (SCLK SPI)
cjmcu.menu.bridgerst.15.build.led_pin=-DLED_PIN=15
cjmcu.menu.bridgerst.16=MO (MOSI SPI)
cjmcu.menu.bridgerst.16.build.led_pin=-DLED_PIN=16
cjmcu.menu.bridgerst.18=A0
cjmcu.menu.bridgerst.18.build.led_pin=-DLED_PIN=18
cjmcu.menu.bridgerst.19=A1
cjmcu.menu.bridgerst.19.build.led_pin=-DLED_PIN=19
cjmcu.menu.bridgerst.20=A2
cjmcu.menu.bridgerst.20.build.led_pin=-DLED_PIN=20

cjmcu.menu.bridge0.2=SDA (I2C)
cjmcu.menu.bridge0.2.build.led_pin=-DLED_PIN=2
cjmcu.menu.bridge0.3=SCL (I2C)
cjmcu.menu.bridge0.3.build.led_pin=-DLED_PIN=3
cjmcu.menu.bridge0.9=D9
cjmcu.menu.bridge0.9.build.led_pin=-DLED_PIN=9
cjmcu.menu.bridge0.10=D10
cjmcu.menu.bridge0.10.build.led_pin=-DLED_PIN=10
cjmcu.menu.bridge0.11=D11
cjmcu.menu.bridge0.11.build.led_pin=-DLED_PIN=11
cjmcu.menu.bridge0.14=MI (MISO SPI)
cjmcu.menu.bridge0.14.build.led_pin=-DLED_PIN=14
cjmcu.menu.bridge0.15=SCK (SCLK SPI)
cjmcu.menu.bridge0.15.build.led_pin=-DLED_PIN=15
cjmcu.menu.bridge0.16=MO (MOSI SPI)
cjmcu.menu.bridge0.16.build.led_pin=-DLED_PIN=16
cjmcu.menu.bridge0.18=A0
cjmcu.menu.bridge0.18.build.led_pin=-DLED_PIN=18
cjmcu.menu.bridge0.19=A1
cjmcu.menu.bridge0.19.build.led_pin=-DLED_PIN=19
cjmcu.menu.bridge0.20=A2
cjmcu.menu.bridge0.20.build.led_pin=-DLED_PIN=20

################################
########### SS Micro ###########
################################

